app/Controllers/Anggota.php

    public function pinjaman_saya()
    {
        $id = session()->get('id');

        $data = [
            'title'    => 'Pinjaman Saya',
            'pinjaman' => $this->pinjamModel
                ->select('peminjaman.*, buku.judul, buku.sampul')
                ->join('buku', 'buku.id_book = peminjaman.id_book')
                ->where('peminjaman.id_user', $id)
                ->orderBy('peminjaman.id_peminjaman', 'DESC')
                ->findAll()
        ];
---
SELECT `peminjaman`.*, `buku`.`judul`, `buku`.`sampul`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id_book` = `peminjaman`.`id_book`
WHERE `peminjaman`.`id_user` = '20'
ORDER BY `peminjaman`.`id_peminjaman` DESC