app/Controllers/BaseController.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        // 1. Inisialisasi Session
        $this->session = \Config\Services::session();

        // 2. Load Model User
        $usersModel = new \App\Models\UsersModel();

        // 3. Ambil data user
        if ($this->session->get('logged_in')) {
            $userId = $this->session->get('id');
            $this->currentUser = $usersModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '21'