app/Controllers/Buku.php

    public function index()
    {
        $db = \Config\Database::connect();
        $id_user = session()->get('id');
        $keyword = $this->request->getGet('keyword');

        $builder = $db->table('buku')
            ->select('buku.*, penulis.nama_penulis, peminjaman.status as status_peminjaman')
            // 🔥 WAJIB TAMBAH JOIN PENULIS DI BAWAH INI
            ->join('penulis', 'penulis.id_penulis = buku.id_penulis', 'left')
            ->join('penerbit', 'penerbit.id = buku.id_penerbit', 'left')
            ->join(
                'peminjaman',
                'peminjaman.id_book = buku.id_book AND peminjaman.id_user = ' . ($id_user ?? 0),
                'left'
            );

        if (!empty($keyword)) {
            $builder->like('buku.judul', $keyword);
        }

        $data['daftar_buku'] = $builder->get()->getResultArray();
---
SELECT `buku`.*, `penulis`.`nama_penulis`, `peminjaman`.`status` as `status_peminjaman`
FROM `buku`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `penerbit` ON `penerbit`.`id` = `buku`.`id_penerbit`
LEFT JOIN `peminjaman` ON `peminjaman`.`id_book` = `buku`.`id_book` AND `peminjaman`.`id_user` = 21

    public function detail($id)
    {
        $db = \Config\Database::connect();

        $data['buku'] = $db->table('buku')
            ->select('buku.*, kategori.nama_kategori, penulis.nama_penulis, penerbit.nama_penerbit, rak.nama_rak')
            ->join('kategori', 'kategori.id_kategori = buku.id_kategori', 'left')
            ->join('penulis', 'penulis.id_penulis = buku.id_penulis', 'left')
            ->join('penerbit', 'penerbit.id = buku.id_penerbit', 'left')
            ->join('rak', 'rak.id_rak = buku.id_rak', 'left')
            ->where('buku.id_book', $id)
            ->get()
            ->getRowArray();
---
SELECT `buku`.*, `kategori`.`nama_kategori`, `penulis`.`nama_penulis`, `penerbit`.`nama_penerbit`, `rak`.`nama_rak`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `penerbit` ON `penerbit`.`id` = `buku`.`id_penerbit`
LEFT JOIN `rak` ON `rak`.`id_rak` = `buku`.`id_rak`
WHERE `buku`.`id_book` = '11'

    public function edit($id)
    {
        $db = \Config\Database::connect();

        return view('buku/edit', [
            'buku'     => $db->table('buku')->where('id_book', $id)->get()->getRowArray(),
            'kategori' => $db->table('kategori')->get()->getResultArray(),
            'penulis'  => $db->table('penulis')->get()->getResultArray(),
            'penerbit' => $db->table('penerbit')->get()->getResultArray(),
            'rak'      => $db->table('rak')->get()->getResultArray(),
        ]);
---
SELECT *
FROM `buku`
WHERE `buku`.`id_book` = '12'

    public function update($id)
    {
        $file = $this->request->getFile('sampul');
        $lama = $this->bukuModel->find($id);

        if ($file->getError() == 4) {
            $nama = $this->request->getPost('sampulLama');
        } else {
            $nama = $file->getRandomName();
            $file->move('img', $nama);

            if ($lama['sampul'] != 'default_cover.jpg' && file_exists('img/' . $lama['sampul'])) {
                unlink('img/' . $lama['sampul']);
            }
        }

        $this->bukuModel->update($id, [
            'judul'        => $this->request->getPost('judul'),
            'id_kategori'  => $this->request->getPost('id_kategori'),
            'id_penulis'   => $this->request->getPost('id_penulis'),
            'id_penerbit'  => $this->request->getPost('id_penerbit'),
            'id_rak'       => $this->request->getPost('id_rak'),
            'tahun_terbit' => $this->request->getPost('tahun_terbit'),
            'stok'         => $this->request->getPost('stok'),
            'sampul'       => $nama
        ]);
---
UPDATE `buku` SET `judul` = 'Laut Bercerita', `id_kategori` = '2', `id_penulis` = '1', `id_penerbit` = '9', `id_rak` = '2', `tahun_terbit` = '2012', `stok` = '12', `sampul` = '1777429019_3015281748b2c01d6336.jpg', `updated_at` = '2026-04-29 02:16:59'
WHERE `buku`.`id_book` IN ('12')