app/Controllers/Home.php

    public function index()
    {
        // 1. Inisialisasi SEMUA Model yang dibutuhkan
        $userModel     = new \App\Models\UsersModel();
        $pinjamModel   = new \App\Models\PeminjamanModel();
        $bukuModel     = new \App\Models\BukuModel();
        $kategoriModel = new \App\Models\KategoriModel(); // Tambahkan ini supaya tidak merah lagi

        // 2. Siapkan data untuk dikirim ke View
        $data = [
            'title'          => 'Dashboard',
            'total_buku'     => $bukuModel->countAllResults(),
            'total_user'     => $userModel->countAllResults(),
            'total_pinjam'   => $pinjamModel->countAllResults(), // Sesuaikan dengan nama di view kamu
            'total_kategori' => $kategoriModel->countAllResults(),
            'all_books'      => $bukuModel->findAll(8),
---
SELECT COUNT(*) AS `numrows`
FROM `buku`
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
SELECT COUNT(*) AS `numrows`
FROM `kategori`
SELECT *
FROM `buku`
 LIMIT 8