app/Controllers/Kategori.php

SELECT *
FROM `kategori`
---
    public function index()
    {
        $model = new KategoriModel();

        $data = [
            'title' => 'Data Kategori',
            'kategori' => $model->findAll()