app/Controllers/Peminjaman.php

SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
LEFT JOIN `users` ON `users`.`id` = `peminjaman`.`id_user`
LEFT JOIN `buku` ON `buku`.`id_book` = `peminjaman`.`id_book`
SELECT `peminjaman`.*, `users`.`nama` AS `nama_peminjam`, `buku`.`judul`
FROM `peminjaman`
LEFT JOIN `users` ON `users`.`id` = `peminjaman`.`id_user`
LEFT JOIN `buku` ON `buku`.`id_book` = `peminjaman`.`id_book`
ORDER BY `peminjaman`.`id_peminjaman` DESC
 LIMIT 5
---
    public function index()
    {
        $keyword = $this->request->getGet('keyword');
        $status  = $this->request->getGet('status');

        // 1. Definisikan builder di awal secara lengkap
        $builder = $this->pinjamModel
            ->select('peminjaman.*, users.nama AS nama_peminjam, buku.judul')
            ->join('users', 'users.id = peminjaman.id_user', 'left')
            ->join('buku', 'buku.id_book = peminjaman.id_book', 'left');

        // 2. Jika ada keyword, tambahkan filter LIKE (jangan di-reset buildernya!)
        if (!empty($keyword)) {
            $builder->groupStart()
                ->like('users.nama', $keyword)
                ->orLike('buku.judul', $keyword)
                ->groupEnd();
        }

        // 3. Jika ada filter status
        if (!empty($status) && $status !== 'all') {
            $builder->where('peminjaman.status', strtolower($status));
        }

        // 4. Urutkan supaya yang terbaru ada di atas (Optional tapi bagus)
        $builder->orderBy('peminjaman.id_peminjaman', 'DESC');

        return view('peminjaman/index', [
            'title'   => 'Data Peminjaman',
            'pinjam'  => $builder->paginate(5, 'peminjaman'),

SELECT *
FROM `users`
SELECT *
FROM `buku`
WHERE `stok` > 0
---
    public function create()
    {
        return view('peminjaman/tambah', [
            'title' => 'Tambah Peminjaman',
            'users' => $this->userModel->findAll(),
            'buku'  => $this->bukuModel->where('stok >', 0)->findAll()

SELECT *
FROM `buku`
WHERE `buku`.`id_book` = '5'
UPDATE `buku` SET `stok` = 81, `updated_at` = '2026-04-23 15:06:54'
WHERE `buku`.`id_book` IN ('5')
---
    public function save()
    {
        $id_book = $this->request->getVar('id_book');

        $this->pinjamModel->save([
            'id_user'         => $this->request->getVar('id_user'),
            'id_book'         => $id_book,
            'tanggal_pinjam'  => $this->request->getVar('tanggal_pinjam'),
            'tanggal_kembali' => $this->request->getVar('tanggal_kembali'),
            'status' => 'dipinjam'
        ]);

        $buku = $this->bukuModel->find($id_book);
        if ($buku && $buku['stok'] > 0) {
            $this->bukuModel->update($id_book, [
                'stok' => $buku['stok'] - 1
            ]);

SELECT *
FROM `peminjaman`
WHERE `id_peminjaman` = '88'
UPDATE `peminjaman` SET `status` = 'kembali', `denda` = 0
WHERE `id_peminjaman` = '88'
---
    public function setujui_bayar($id)
    {
        $db = \Config\Database::connect();

        // 1. Cek apakah data ada
        $cek = $db->table('peminjaman')->where('id_peminjaman', $id)->get()->getRow();

        if ($cek) {
            // 2. Update status jadi kembali dan denda jadi 0
            $db->table('peminjaman')->where('id_peminjaman', $id)->update([
                'status' => 'kembali',
                'denda'  => 0
            ]);