app/Controllers/penerbit.php

    public function index()
    {
        $model = new PenerbitModel();

        $data = [
            'title' => 'Data Penerbit',
            'penerbit' => $model->findAll()
        ];
---
SELECT *
FROM `penerbit`