app/Controllers/Setting.php

    public function index()
    {
        $userId = session()->get('id') ?? session()->get('id_user');

        $data = [
            'user' => $this->usersModel->find($userId)
        ];
---
SELECT *
FROM `users`
WHERE `users`.`id` = '21'