app/Controllers/Users.php

    public function index()
    {
        $keyword = $this->request->getGet('keyword');
        $role    = $this->request->getGet('role');

        $usersModel = $this->users;

        // Filter Username atau Nama
        if ($keyword) {
            $usersModel->groupStart()
                ->like('username', $keyword)
                ->orLike('nama', $keyword)
                ->groupEnd();
        }

        // Filter Role
        if ($role) {
            $usersModel->where('role', $role);
        }

        $data = [
            'users'   => $usersModel->findAll(),
            'title'   => 'Data Management Users',
            'keyword' => $keyword,
            'role'    => $role
        ];
---
SELECT *
FROM `users`

    public function edit($id)
    {
        return view('users/edit', [
            'user' => $this->users->find($id)
        ]);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '21'

    public function profile()
    {
        // Cek dulu apakah user sudah login
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('login'));
        }

        // Ambil data user yang sedang login dari database
        // Ambil data user yang sedang login
        $userId = session()->get('id');
        $data = [
            'title' => 'Profil Saya',
            'user'  => $this->users->find($userId) // Pake $this->users sesuai baris 142
---
SELECT *
FROM `users`
WHERE `users`.`id` = '21'