app/Models/BukuModel.php

    public function getBukuLengkap()
    {
        // Gunakan 'left' di parameter ketiga fungsi join
        return $this->select('buku.*, penulis.nama_penulis')
            ->join('penulis', 'penulis.id_penulis = buku.id_penulis', 'left')
            ->findAll();
---
SELECT `buku`.*, `penulis`.`nama_penulis`
FROM `buku`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`